TSD_TK/src/DataProcessors/ПанельМеню/ПанельМеню.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельМеню</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПодтверждено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>EnumRef.ПричиныРасхождения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодХарактеристики</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспМРЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхожденияПорядок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СканированиеЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроверена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпецЦена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЦенник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладUUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инфо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведен</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрыт</name>
      <comment>0 - новый 1 - закрыт частично 2 - закрыт полностью</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеПроцесса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

TSD_TK/src/Catalogs/ТипыДокументов/ТипыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыДокументов</name>
  <predefined>
    <items>
      <name>БезакцептныйПрием</name>
      <description>Безакцептне приймання</description>
    </items>
    <items>
      <name>БезакцептныйПриемPKG</name>
      <description>Безакцептный Прием PKG</description>
    </items>
    <items>
      <name>ВыдачаДС</name>
      <description>Видача ДС</description>
    </items>
    <items>
      <name>ЗаданиеИН</name>
      <description>Завдання інв-ція</description>
    </items>
    <items>
      <name>Задание</name>
      <description>Задание</description>
    </items>
    <items>
      <name>ЗаданиеВФ</name>
      <description>Задание Верификация</description>
    </items>
    <items>
      <name>Zak</name>
      <description>Замовлення</description>
    </items>
    <items>
      <name>Заявка</name>
      <description>Заявка</description>
    </items>
    <items>
      <name>Инвентаризация</name>
      <description>Инвентаризация</description>
    </items>
    <items>
      <name>ИнвентаризацияТБД</name>
      <description>Инвентаризация ТБД</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>Контролер</name>
      <description>Контролер</description>
    </items>
    <items>
      <name>ЛокальнаяИнвентаризация</name>
      <description>Локальная инвентаризация</description>
    </items>
    <items>
      <name>МаршрутныйЛист</name>
      <description>Маршрутный лист</description>
    </items>
    <items>
      <name>ЗаданиеТБД</name>
      <description>Не продається</description>
    </items>
    <items>
      <name>ПроверкаСтандартов</name>
      <description>Перевірка стандартів</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ВозвратПеремещение</name>
      <description>Переміщення (логістика)</description>
    </items>
    <items>
      <name>Переоценки</name>
      <description>Переоценки</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортиця</description>
    </items>
    <items>
      <name>Печать</name>
      <description>Печать</description>
    </items>
    <items>
      <name>ВозвратТоваров</name>
      <description>Повернення постачальнику</description>
    </items>
    <items>
      <name>Посетители</name>
      <description>Посетители</description>
    </items>
    <items>
      <name>ПриемПоЗаказу</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемPKG</name>
      <description>Прием PKG</description>
    </items>
    <items>
      <name>ПриемПоПриходу</name>
      <description>Прием по приходу</description>
    </items>
    <items>
      <name>ПриходУход</name>
      <description>Приход уход</description>
    </items>
    <items>
      <name>Рекламация</name>
      <description>Рекламация</description>
    </items>
    <items>
      <name>Списание2</name>
      <description>Списание</description>
    </items>
    <items>
      <name>ЗаданиеТНП</name>
      <description>Термін придатності</description>
    </items>
    <items>
      <name>Уведомление</name>
      <description>Уведомление</description>
    </items>
    <items>
      <name>Уценка</name>
      <description>Уценка</description>
    </items>
    <items>
      <name>Фото</name>
      <description>Фото</description>
    </items>
    <items>
      <name>ФотоСчетчика</name>
      <description>Фото счетчика</description>
    </items>
  </predefined>
</mdclass:Catalog>

TSD_TK/src/DataProcessors/ПанельМеню/Forms/СписокДокументов/Module.bsl
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.ПриемПоЗаказу")
			ИЛИ ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Перемещение") 
			ИЛИ ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.ПриемТоваров") Тогда	
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
			ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();   
		
	ИначеЕсли  ИмяСобытия = "KeyPress"  И ВводДоступен() Тогда
		Если ЭтаФорма.ТекущийЭлемент	= Элементы.КонтрагентОтбор Тогда
			Если  НРег(Параметр) = "enter"Тогда
				ПолучитьКонтрагента(Неопределено);
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ОбновитьЗадания" Тогда
		
		  ЗаполнитьСписокЗаданий();
		  
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	СтрокаПоиска = ПолученныйШтрихкод;
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.ПриемПоЗаказу") Тогда
		
		ДанныеЗаказа = ИнтеграцияТК_Клиент.ПолучитьДанныеПоЗаказам(ПолученныйШтрихкод);
		
		ОбработатьПолученныеДанные(ДанныеЗаказа,Параметры);
		
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Перемещение") Тогда
	    ОбработатьШтрихкодПеремещения(ПолученныйШтрихкод);
	ИначеЕсли ТипыДокументов = 	ПредопределенноеЗначение("Перечисление.ТипыДокументов.ПриемТоваров") Тогда
		ДанныеЗаказа = ИнтеграцияТК_Клиент.ПолучитьДанныеПоЗаказам(ПолученныйШтрихкод,0);
	
		ОбработатьПолученныеДанные(ДанныеЗаказа,Параметры);
	КонецЕсли;
	СтрокаПоиска = "";
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПолученныеДанные(ДанныеЗаказа, ДополнительныеПараметры) Экспорт
	
	Если ДанныеЗаказа.Результат = ложь Тогда
		Сообщить(?(ЗначениеЗаполнено(ДанныеЗаказа.ОписаниеОшибки), ДанныеЗаказа.ОписаниеОшибки,"Данные не получены"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуЗаказов(ДанныеЗаказа);
	
Конецпроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодПеремещения(ПолученныйШтрихкод)
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Сообщить("Штрих-код не введен! Форма не будет открыта!");
	Иначе		
		
		Если СтрДлина(ПолученныйШтрихкод)<= 10 Тогда
			ПараметрыДокумента = Новый Структура;
			ПараметрыДокумента.Вставить("ВидДокумента", "ПеремещениеТоваров");
			ПараметрыДокумента.Вставить("ДокументUUID", ПолученныйШтрихкод);
			
			ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
			Если ДанныеДокумента.Результат Тогда
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеВыборДокументаПеремещение", ЭтотОбъект);
				
				тПараметры = Новый Структура("ТаблицаДокумтов", ДанныеДокумента.Ответ);
				ОткрытьФорму("ОбщаяФорма.ФормаВыбораПеремещения",тПараметры,Этаформа,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
				
			Иначе
				Сообщить(ДанныеДокумента.ОписаниеОшибки);
			КонецЕсли;
			
			
			
		Иначе
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров"));
			ПараметрыФормы.Вставить("ОснованиеUUID", СокрЛП(ПолученныйШтрихкод));
			ПараметрыФормы.Вставить("ЦветоваяИндикация", ЦветоваяИндикация);
			ПараметрыФормы.Вставить("ПриходПоПеремещению", Истина);
			
			ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
&НаКлиенте
Процедура ОповещениеВыборДокументаПеремещение(ПолученныйШтрихкод,ДополнительныеПараметры)Экспорт
	
	Если ПолученныйШтрихкод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента", ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров"));
	ПараметрыФормы.Вставить("ОснованиеUUID", "OS-"+СокрЛП(ПолученныйШтрихкод));
	ПараметрыФормы.Вставить("ЦветоваяИндикация", ЦветоваяИндикация);
	ПараметрыФормы.Вставить("ПриходПоПеремещению", Истина);
	
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьТаблицуЗаказов(ДанныеЗаказа) 
	
	Объект.Документы.Очистить();
	Если  ТипыДокументов = 	ПредопределенноеЗначение("Перечисление.ТипыДокументов.ПриемТоваров")  Тогда
		ТД = "Поступление";
	Иначе
		 ТД = "Заказ";
	КонецЕсли;
	
	Для Каждого СтрДок Из ДанныеЗаказа.Ответ Цикл 
		нСтрока = Объект.Документы.Добавить();
		нСтрока.ТипДокумента = ТД;
		нСтрока.Дата =  СтрДок.ДатаПоставки;
		нСтрока.НомерДокумента =  СтрДок.Номер;
		нСтрока.Контрагент =  СтрДок.Поставщик;
		нСтрока.ДокументUUID =  СтрДок.Док_ID;
		нСтрока.Сумма =  СтрДок.Сумма;
		ОбновитьЗаписьПоСтроке(нСтрока);
	КонецЦикла;
	
	УстановитьВидимостьСтраницСервер();
	
		
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницСервер()
	
	
		Если Объект.Документы.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаОтбор", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы", "Видимость", Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаОтбор", "Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы", "Видимость", Ложь);
			
		КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормыПоПечатиНаСервере(ИдентификаторСтроки,РезультатПечати)
	
	СтрокаТаблицы = Объект.Документы.НайтиПоИдентификатору(ИдентификаторСтроки);

	ДанныеПечати = РезультатПечати.ДанныеПоПечати;
	МассивТоваров = ДанныеПечати.Товары;
	СтрокаТаблицы.КоличествоПринято = МассивТоваров.Количество();
	
	Если СтрокаТаблицы.КоличествоПринято =  СтрокаТаблицы.КоличествоПоставщика Тогда
		СтрокаТаблицы.ДокументЗакрыт = 2;
	ИначеЕсли СтрокаТаблицы.КоличествоПринято <> 0 Тогда
		СтрокаТаблицы.ДокументЗакрыт = 1;
	Иначе
		СтрокаТаблицы.ДокументЗакрыт = 0;
	КонецЕсли;
	
	Для Каждого ТоварПечать Из МассивТоваров Цикл 
		нСтрокиТоваров = Объект.Товары.НайтиСтроки(ТоварПечать);
		Если нСтрокиТоваров.Количество()> 0 Тогда
			нСтрокиТоваров[0].КоличествоПодтверждено = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	

	
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	 
	
	ПериодДокументов = ТекущаяДата();
	
	Если Параметры.Свойство("КлючОткрытия") Тогда
		
		ТипыДокументов = Перечисления.ТипыДокументов.Задание;
		Если Параметры.КлючОткрытия = "Задание" Тогда
			Заголовок = "Задачи";
			ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание");
		ИначеЕсли Параметры.КлючОткрытия = "ЗаданиеВФ" Тогда
			
			Заголовок = "Верификация";
			ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ");
		ИначеЕсли Параметры.КлючОткрытия = "ЗаданиеТБД" Тогда
	        Заголовок = "Не продається";//"ТБД";
			ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД");
		ИначеЕсли Параметры.КлючОткрытия = "ЗаданиеТНП" Тогда
	        Заголовок = "Термін придатності";//"ТНП";
			ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП");
	   	ИначеЕсли Параметры.КлючОткрытия = "Стандарты" Тогда
              Заголовок = "Перевірка стандартів";//"Анкеты";
			ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПроверкаСтандартов");

		Иначе
			Заголовок = "Инвентаризации";
			ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН");
		КонецЕсли;
		
		ЗаполнитьСписокЗаданий();
	ИначеЕсли Параметры.Свойство("Переоценки") Тогда
		
		ТипДокумента = Справочники.ТипыДокументов.Переоценки;
		ТипыДокументов = Перечисления.ТипыДокументов.Переоценка;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТипыДокументов,СтрокаПоиска,ОтборКонтрагент", "Видимость", Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы", "Заголовок", "Переоценки");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.ЗакладкиСверху);
		
		
	Иначе
		
		
		Элементы.ТипыДокументов.СписокВыбора.Очистить();
		ПервыйТипдокумента = Неопределено;
		Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПриемПоЗаказу() Тогда
			Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.ПриемПоЗаказу,"Прийом замовлення");
			ПервыйТипдокумента=  Перечисления.ТипыДокументов.ПриемПозаказу;	
		КонецЕсли;
		
		Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПриемПоПриходу() Тогда
			Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.ПриемТоваров ,"Прийом приходу");	
			Если ПервыйТипдокумента = Неопределено Тогда
				ПервыйТипдокумента=  Перечисления.ТипыДокументов.ПриемТоваров;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПриемПоПеремещению() Тогда
			Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.Перемещение  ,"Прийом переміщенню");	
			Если ПервыйТипдокумента = Неопределено Тогда
				ПервыйТипдокумента=  Перечисления.ТипыДокументов.Перемещение;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПереоценка() Тогда
			Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.Переоценка  ,"Переоцінка");	
			Если ПервыйТипдокумента = Неопределено Тогда
				ПервыйТипдокумента=  Перечисления.ТипыДокументов.Переоценка;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЖурналИнвентаризация() Тогда
			Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.Инвентаризация   ,"Інвентаризація");	
			Если ПервыйТипдокумента = Неопределено Тогда
				ПервыйТипдокумента=  Перечисления.ТипыДокументов.Инвентаризация;	
			КонецЕсли;
			
		КонецЕсли;
		Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЖурналИнвентаризация() Тогда
			Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.Печать,"Друк (Реєстр)");	
			Если ПервыйТипдокумента = Неопределено Тогда
				ПервыйТипдокумента=  Перечисления.ТипыДокументов.Печать;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЖурналЗаказыПоставщику() Тогда
			Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.Zak,"Замовлення постачальнику");	
			Если ПервыйТипдокумента = Неопределено Тогда
				ПервыйТипдокумента=  Перечисления.ТипыДокументов.Zak;	
			КонецЕсли;
			
		КонецЕсли;
					Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЖурналРекламация() Тогда
				Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.Рекламация ,"Рекламація");	
				Если ПервыйТипдокумента = Неопределено Тогда
					ПервыйТипдокумента=  Перечисления.ТипыДокументов.Рекламация;	
				КонецЕсли;
				
			КонецЕсли;

		
		Элементы.ТипыДокументов.СписокВыбора.Добавить(Перечисления.ТипыДокументов.Заявка,"ServiceDesk");
		
		Если Элементы.ТипыДокументов.СписокВыбора.Количество() = 0 Тогда
			Отказ = Истина;
			Сообщить("Немає операцій журналу, настройте доступн");
			Возврат;
		КонецЕсли;
		
		
		ТипыДокументов = ПервыйТипдокумента;	
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	НастроитьФормуПоОриентацииЭкрана();

	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбновитьПодразделение();
	
	НастроитьФормуПоТипуДокумента();
	
	ПечатьДокументаТип = 1;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Склад = "";
		Инициализирован = Ложь;
		
	Иначе
		Если ПараметрыСеанса.Подразделение <> Элементы.СообщениеИнициализации.Заголовок Тогда
			Склад = "";
			СкладUUID = "";
		КонецЕсли;
		

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;

	
КонецПроцедуры


&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	ГоризонтальнаяОриентацияЭкрана = ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана;
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
	//	Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаГоризонтальная;
	Иначе
		Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаВертикальная;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры








&НаКлиенте
Процедура Заполнить(Команда)
	Если Не Инициализирован Тогда
		Сообщить("Пристрій не ініціалізований");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипыДокументов) Тогда
		 Сообщить("Не вказано <Операція>");
	КонецЕсли;

	Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Заявка") Тогда
		ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка"));
		ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	Иначе
		
		Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Печать") И ПечатьДокументаТип = 8 Тогда
			
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("СформироватьОтчетОстаткиТНП");
			
			ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			ЗаполнитьСписокДокументов();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументов()
	
	Объект.Документы.Очистить();

	//Попытка	
	//	УдалитьФайлы(КаталогВременныхФайлов(),"*.pdf"); 
	//Исключение
	//КонецПопытки;
	 
	Если ТипыДокументов = Перечисления.ТипыДокументов.Zak тогда
		ТипДок = "ZAK";
	ИначеЕсли ТипыДокументов = Перечисления.ТипыДокументов.ПриемПоЗаказу Тогда
		//ТипДок = "ZAK";
		Возврат;   
	ИначеЕсли ТипыДокументов = Перечисления.ТипыДокументов.Рекламация Тогда	 
		ТипДок = "RECLAM";
	ИначеЕсли ТипыДокументов = Перечисления.ТипыДокументов.Инвентаризация Тогда
		ТипДок = "Инвентаризация";
		
		ДанныеДокументов = ИнтеграцияТК_ВызовСервера.ПолучитьСписокДокументов(ПериодДокументов,ТипДок,?(ПустаяСтрока(КонтрагентОтборUUID),"null",КонтрагентОтборUUID));
		ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация");
	//	Объект.Документы.Очистить();
		Если ДанныеДокументов.Результат Тогда
			Если НЕ ПустаяСтрока(ДанныеДокументов.ОписаниеОшибки) Тогда
				Сообщить(ДанныеДокументов.ОписаниеОшибки);
				Возврат;
			КонецЕсли;
			
			для Каждого стДок Из ДанныеДокументов.Ответ Цикл 
				нСтрокадокумент = Объект.Документы.Добавить();
				нСтрокадокумент.ТипДокумента   = ТипДок;
				нСтрокадокумент.Дата           = Дата(стДок.Data);
				нСтрокадокумент.НомерДокумента = стДок.NomDoc;
				нСтрокадокумент.ДокументUUID   = стДок.DocUUID;
				нСтрокадокумент.СкладUUID      = стДок.SkladUUID;
				нСтрокадокумент.Инфо           = стДок.Info;

				ОбновитьЗаписьПоСтроке(нСтрокадокумент);
			КонецЦикла;
			
		КонецЕсли;
		 ЭтаФорма.ТекущийЭлемент  = Элементы.СтраницаДокументы;
		Возврат;
		 
	ИначеЕсли ТипыДокументов = Перечисления.ТипыДокументов.ПриемТоваров Тогда
		ТипДок = "PRIX";
	ИначеЕсли ТипыДокументов = Перечисления.ТипыДокументов.СписокПриходов Тогда
		ТипДок = "РеестрПриходов";
		ДанныеДокументов = ИнтеграцияТК_ВызовСервера.ПолучитьСписокДокументов(ПериодДокументов,ТипДок,?(ПустаяСтрока(КонтрагентОтборUUID),"null",КонтрагентОтборUUID));
		Если ДанныеДокументов.Результат Тогда
			
			Если НЕ ПустаяСтрока(ДанныеДокументов.ОписаниеОшибки) Тогда
				Сообщить(ДанныеДокументов.ОписаниеОшибки);
				Возврат;
			КонецЕсли;
			
			для Каждого стДок Из ДанныеДокументов.Ответ Цикл 
				нСтрокадокумент = Объект.Документы.Добавить();
				нСтрокадокумент.ТипДокумента   = ТипДок;
				Попытка
					нСтрокадокумент.Дата           = Дата(стДок.Дата);
				Исключение
				КонецПопытки;
				нСтрокадокумент.НомерДокумента = стДок.НомерДокумента;
				нСтрокадокумент.Контрагент     = стДок.Контрагент;
				нСтрокадокумент.Проведен       = стДок.Проведен;
				нСтрокадокумент.Регл           = стДок.Регл;
				нСтрокадокумент.Акт            = стДок.Акт;
				нСтрокадокумент.КоличествоПринято            = стДок.КоличествоПринято;
				нСтрокадокумент.КоличествоПоставщика         = стДок.КоличествоПоставщика;

				нСтрокадокумент.ДокументUUID   = стДок.DocUUID;
				нСтрокадокумент.ДокументыЗаписьПоСтроке  =  ?(стДок.Регл=1,"Ф1","Ф2")+ " - "+нСтрокадокумент.Контрагент +?(стДок.Акт=1," - АКТ","");
			КонецЦикла;
			
		КонецЕсли;
		ЭтаФорма.ТекущийЭлемент  = Элементы.СтраницаДокументы;
		Возврат;
		
	ИначеЕсли ТипыДокументов = Перечисления.ТипыДокументов.Переоценка Тогда
		ТипДок = "Переоценка";
		ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Переоценки");

		Объект.Товары.Очистить();
		ДанныеДокументов = ИнтеграцияТК_ВызовСервера.ПолучитьСписокДокументов(ПериодДокументов,ТипДок,"null");
		Если ДанныеДокументов.Результат Тогда
			
			Если НЕ ПустаяСтрока(ДанныеДокументов.ОписаниеОшибки) Тогда
				Сообщить(ДанныеДокументов.ОписаниеОшибки);
				Возврат;
			КонецЕсли;
			ИД = 0;
			для Каждого стДок Из ДанныеДокументов.Ответ Цикл 
				ЦветЦенника = "Білий";
				Если стДок.КодЦенника = 27 Тогда
					ЦветЦенника =  "Жовтий";
				ИначеЕсли стДок.КодЦенника = 28 Тогда
					ЦветЦенника =  "Синій";
				ИначеЕсли стДок.КодЦенника = 29 ИЛИ стДок.КодЦенника = 26 ИЛИ стДок.КодЦенника = 36  Тогда	
					ЦветЦенника =  "Помаранчевий";                       
				Иначе
					ЦветЦенника =  "Білий";
				КонецЕсли;
				   
				
				нСтрокадокумент = Объект.Документы.Добавить();
				нСтрокадокумент.ТипДокумента   = ТипДок;
				нСтрокадокумент.Дата           = ПериодДокументов;
				нСтрокадокумент.НомерДокумента = стДок.КодЦенника;
				нСтрокадокумент.Контрагент     = стДок.НазваниеЦенника +" "+ЦветЦенника;
				
                сч = 0;
				Для Каждого ТоварЦенника Из стДок.ДанныеПоТоварам Цикл 
					сч = сч + 1;
					нСтрокаТовары = Объект.Товары.Добавить();
					нСтрокаТовары.Артикул = ТоварЦенника.Артикул;
					нСтрокаТовары.НаименованиеТовара = ТоварЦенника.Номенклатура;
					нСтрокаТовары.Характеристика = ТоварЦенника.Характеристика;
					нСтрокаТовары.КодХарактеристики = ТоварЦенника.КодХар;
					нСтрокаТовары.Продажи = ТоварЦенника.Цена;
					нСтрокаТовары.НомерСтрокиДокумента = ИД;
					
				КонецЦикла;
				нСтрокадокумент.Сумма     = сч;
				нСтрокадокумент.КоличествоПоставщика     = сч;

				нСтрокадокумент.ИД        = ИД;
				ИД = ИД + 1;
				ОбновитьЗаписьПоСтроке(нСтрокадокумент);

				
				
			КонецЦикла;
		Иначе
			Если НЕ ПустаяСтрока(ДанныеДокументов.ОписаниеОшибки) Тогда
				Сообщить(ДанныеДокументов.ОписаниеОшибки);
				Возврат;
			КонецЕсли;

		КонецЕсли;
		ЭтаФорма.ТекущийЭлемент  = Элементы.СтраницаДокументы;
		Возврат;
	ИначеЕсли 	ТипыДокументов = Перечисления.ТипыДокументов.Печать Тогда
		МассивДокРеестр = Новый Массив;	
		Если  ПечатьДокументаТип = 1 Тогда
			МассивДокРеестр.Добавить("PrintPR");
			//ТипДок = "PrintPR";
		ИначеЕсли ПечатьДокументаТип = 2 Тогда
			МассивДокРеестр.Добавить("PrintSP");
			//ТипДок = "PrintSP";
		ИначеЕсли ПечатьДокументаТип = 5 Тогда 
			МассивДокРеестр.Добавить("PrintVP");
			//ТипДок = "PrintVP";
		ИначеЕсли ПечатьДокументаТип = 4 Тогда
			МассивДокРеестр.Добавить("PrintPRP");
			//ТипДок = "PrintPRP";
		ИначеЕсли ПечатьДокументаТип = 6 Тогда 
			МассивДокРеестр.Добавить("PrintIN");
			//ТипДок = "PrintIN";
		ИначеЕсли ПечатьДокументаТип = 7 Тогда  
			//МассивДокРеестр.Добавить("PrintRE");
			МассивДокРеестр.Добавить("РеестрПриходов");
			МассивДокРеестр.Добавить("PrintIN");
			МассивДокРеестр.Добавить("PrintPRP");
			МассивДокРеестр.Добавить("PrintVP"); 
			МассивДокРеестр.Добавить("PrintSP"); 
			МассивДокРеестр.Добавить("PrintPR");
			//	ТипДок = "PrintRE";
		ИначеЕсли ПечатьДокументаТип = 8 Тогда
			Возврат;      
		ИначеЕсли ПечатьДокументаТип = 9 Тогда
			МассивДокРеестр.Добавить("PrintZSD");
		Иначе	
			//ТипДок = "РеестрПриходов";  
			МассивДокРеестр.Добавить("РеестрПриходов");
			
		КонецЕсли;
		
		Для Каждого ТипДок Из МассивДокРеестр Цикл 
			ДанныеДокументов = ИнтеграцияТК_ВызовСервера.ПолучитьСписокДокументов(ПериодДокументов,ТипДок,?(ПустаяСтрока(КонтрагентОтборUUID),"null",КонтрагентОтборUUID));
			
			Если ДанныеДокументов.Результат  = Ложь Тогда
				
				Если НЕ ПустаяСтрока(ДанныеДокументов.ОписаниеОшибки)  И НЕ ПечатьДокументаТип = 7 Тогда
					Сообщить(ДанныеДокументов.ОписаниеОшибки);
				КонецЕсли; 
				Продолжить;

			Иначе	
				для Каждого стДок Из ДанныеДокументов.Ответ Цикл 
					нСтрокадокумент = Объект.Документы.Добавить();
					нСтрокадокумент.ТипДокумента   = ТипДок; 
					нСтрокадокумент.ДокументUUID   = стДок.DocUUID;
					
					
					Если стДок.Свойство("Дата") Тогда	
						Попытка
							нСтрокадокумент.Дата           = Дата(стДок.Дата);
						Исключение
						КонецПопытки;   
					КонецЕсли; 
					Если стДок.Свойство("Data") Тогда	
						нСтрокадокумент.Дата           = Дата(стДок.Data); 
					КонецЕсли;
					
					Если стДок.Свойство("НомерДокумента") Тогда
						нСтрокадокумент.НомерДокумента = стДок.НомерДокумента;
					КонецЕсли;     
					
					Если стДок.Свойство("NomDoc") Тогда
						нСтрокадокумент.НомерДокумента = стДок.NomDoc;
					КонецЕсли;
					
					Если стДок.Свойство("Контрагент") Тогда
						нСтрокадокумент.Контрагент     = стДок.Контрагент;
					КонецЕсли;  
					Если стДок.Свойство("Client") Тогда
						нСтрокадокумент.Контрагент     = стДок.Client; 
					КонецЕсли; 
					Если стДок.Свойство("Naz") Тогда   
						нСтрокадокумент.Контрагент =  стДок.Naz
					КонецЕсли;
					
					Если стДок.Свойство("Sum") Тогда
						нСтрокадокумент.Сумма          = стДок.Sum; 
					КонецЕсли;
					
					Если стДок.Свойство("Проведен") Тогда
						нСтрокадокумент.Проведен       = стДок.Проведен;
					КонецЕсли;   
					Если стДок.Свойство("Регл") Тогда	
						нСтрокадокумент.Регл           = стДок.Регл; 
					КонецЕсли;  
					Если стДок.Свойство("Акт") Тогда
						нСтрокадокумент.Акт            = стДок.Акт; 
					КонецЕсли; 
					Если стДок.Свойство("КоличествоПринято") Тогда
						нСтрокадокумент.КоличествоПринято            = стДок.КоличествоПринято; 
					КонецЕсли;
					Если стДок.Свойство("КоличествоПоставщика") Тогда
						нСтрокадокумент.КоличествоПоставщика         = стДок.КоличествоПоставщика;  
					КонецЕсли;
					
					Если стДок.Свойство("kol") Тогда
						нСтрокадокумент.КоличествоПринято          = стДок.kol;
					КонецЕсли;
					
					Если стДок.Свойство("Регл") И стДок.Свойство("Акт") Тогда
						нСтрокадокумент.ДокументыЗаписьПоСтроке  =  ?(стДок.Регл=1,"Ф1","Ф2")+ " - "+нСтрокадокумент.Контрагент +?(стДок.Акт=1," - АКТ","");
					Иначе
						ОбновитьЗаписьПоСтроке(нСтрокадокумент);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли; 
		КонецЦикла;
		ЭтаФорма.ТекущийЭлемент  = Элементы.СтраницаДокументы;

			Возврат;

		КонецЕсли;
	
	ДанныеДокументов = ИнтеграцияТК_ВызовСервера.ПолучитьСписокДокументов(ПериодДокументов,ТипДок,?(ПустаяСтрока(КонтрагентОтборUUID),"null",КонтрагентОтборUUID));
	
	//Объект.Документы.Очистить();
	Если ДанныеДокументов.Результат Тогда
		для Каждого стДок Из ДанныеДокументов.Ответ Цикл 
			нСтрокадокумент = Объект.Документы.Добавить();
			нСтрокадокумент.Дата           = Дата(стДок.Data);
			нСтрокадокумент.ТипДокумента   = ТипДок;
			нСтрокадокумент.НомерДокумента = стДок.NomDoc;
			нСтрокадокумент.ДокументUUID   = стДок.DocUUID;
			нСтрокадокумент.Контрагент     = стДок.Client;
			нСтрокадокумент.КонтрагентUUID = стДок.ClientUUID;
			нСтрокадокумент.Сумма          = стДок.Sum;
			ОбновитьЗаписьПоСтроке(нСтрокадокумент);
		КонецЦикла;
		
		Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаДокументы;
		
	КонецЕсли;
	Если Объект.Документы.Количество() = 0 Тогда
		Сообщить("Немає документів");  
	КонецЕсли;
	
	УстановитьВидимостьСтраницСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗаданий()
	
	Объект.Документы.Очистить();
	ТипДок = ТипДокумента.ИмяПредопределенныхДанных;
	ДанныеДокументов = ИнтеграцияТК_ВызовСервера.ПолучитьСписокДокументов(ПериодДокументов,ТипДок,"null");
	
	Если ДанныеДокументов.Результат Тогда
		для Каждого стДок Из ДанныеДокументов.Ответ Цикл 
			нСтрокадокумент = Объект.Документы.Добавить();
			нСтрокадокумент.Дата           = Дата(стДок.Data);
			нСтрокадокумент.ДатаИсполнения = ?(ПустаяСтрока(стДок.DataF),ТекущаяДатаСеанса(),Дата(стДок.DataF));
			Если стДок.Свойство("TipDoc") Тогда
				нСтрокадокумент.ТипДокумента     =  стДок.TipDoc;
			Иначе
				нСтрокадокумент.ТипДокумента   = ТипДок;
			КонецЕсли;
		
			нСтрокадокумент.Инфо = стДок.NomDoc;
			нСтрокадокумент.ДокументUUID   = стДок.DocUUID;
			Если стДок.Свойство("Kontr") Тогда
				нСтрокадокумент.Контрагент=стДок.Kontr;
			КонецЕсли;
			Если стДок.Свойство("zp") Тогда 
				нСтрокадокумент.ЗаданиеПроцесса=стДок.zp;
			КонецЕсли;
			
			Если стДок.Свойство("MenUUID") Тогда
				нСтрокадокумент.КонтрагентUUID     =  стДок.MenUUID;//ИД сотрудник
			КонецЕсли;

			ОбновитьЗаписьПоСтроке(нСтрокадокумент);
		КонецЦикла;
		
		
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент  = Элементы.СтраницаДокументы;
	

КонецПроцедуры


&НаСервере
Функция ПолучитьИмядокумента(Знач ТипДок)
	ТипДокВозврат ="";
	Если ТипДок = "ZAK" Тогда
	   ТипДокВозврат = "Заказ поставщику";
   ИначеЕсли ТипДок = "IN" ИЛИ ТипДок = "Инвентаризация" Тогда
	   ТипДокВозврат = "Инвентаризация товаров";
   КонецЕсли;
   
   Возврат ТипДокВозврат
	
КонецФункции


&НаСервере
Процедура ОбновитьЗаписьПоСтроке(Знач Строка, ИдентификаторСтроки = Неопределено)
	
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		СтрокаТЧ = Объект.Документы.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		СтрокаТЧ = Строка;
	КонецЕсли;
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		Если СтрокаТЧ.ЗаданиеПроцесса = 1 Тогда
			ЗаписьПоСтроке = НСтр("ru = '%Инфо%'");
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Инфо%",?(ПустаяСтрока(СтрокаТЧ.Инфо),"","<"+СтрокаТЧ.Инфо+" "+СтрокаТЧ.Контрагент+ ">"));
		Иначе
			ЗаписьПоСтроке = НСтр("ru = 'Исполнить до %ДатаФ% %Инфо%'");
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%ДатаФ%",СтрокаТЧ.ДатаИсполнения );
			ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Инфо%",?(ПустаяСтрока(СтрокаТЧ.Инфо),"","<"+СтрокаТЧ.Инфо+" "+СтрокаТЧ.Контрагент+ ">"));
		КонецЕсли;
	Иначе
		
		ЗаписьПоСтроке = НСтр("ru = '%Документ% %Контрагент% %Сумма% %Инфо%'");
		
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Документ%",ПолучитьИмядокумента(СтрокаТЧ.ТипДокумента) );
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Контрагент%",?(ПустаяСтрока(СтрокаТЧ.Контрагент),"","<"+СтрокаТЧ.Контрагент+">"));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Сумма%",     Формат(СтрокаТЧ.Сумма, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Инфо%",?(ПустаяСтрока(СтрокаТЧ.Инфо),"","<"+СтрокаТЧ.Инфо+">"));
	КонецЕсли;
	
	СтрокаТЧ.ДокументыЗаписьПоСтроке = ЗаписьПоСтроке;
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ДокументыВыбор(Элемент,,,);
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.СписокПриходов")
		ИЛИ ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Печать") Тогда
		Возврат;
	КонецЕсли;
	
	
	ПараметрыСтроки = ПолучитьПараметрыСтроки();

 	Если НЕ ПараметрыСтроки = Неопределено Тогда
		
		Попытка
			 
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ПараметрыСтроки.ИдентификаторСтроки);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеИзменитьСтроку", ЭтотОбъект, ДополнительныеПараметры);
			
			
			Если ПараметрыСтроки.ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ФотоСчетчика") Тогда
				РезОткрытия = ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаФотоСчетчика", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			//Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
			//	РезОткрытия = ОткрытьФорму("Обработка.ПанельМеню.Форма.ПроверкаЦен", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения);

			Иначе			
				РезОткрытия = ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;

	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеИзменитьСтроку(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;

	
	Если Результат.Свойство("УдалитьСтроку") Тогда
			
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН")
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
			
			//Если Объект.Документы.Количество() > 0 Тогда
			//	//СтрокаТаблицы = Объект.Документы.НайтиПоИдентификатору(ИдентификаторСтроки);
			//ИндексСтроки = Объект.Документы.Индекс(СтрокаТаблицы);
			//Объект.Документы.Удалить(ИндексСтроки);
			//
			Оповестить("ПроверитьЗадачи");
			Если Объект.Документы.Количество() = 0 Тогда
				Закрыть();
			КонецЕсли;
			
			//Иначе
			//	Оповестить("ПроверитьЗадачи");
			//	Закрыть();
			//	
			//КонецЕсли;
			
		Иначе
			СтрокаТаблицы = Объект.Документы.НайтиПоИдентификатору(ИдентификаторСтроки);

			ИндексСтроки = Объект.Документы.Индекс(СтрокаТаблицы);
			Объект.Документы.Удалить(ИндексСтроки);

			УстановитьВидимостьСтраницСервер();
		КонецЕсли;
	ИначеЕсли Результат.Свойство("ОбработатьСтрокиПоПереоценки") Тогда
		   
		  ОбновитьДанныеФормыПоПечатиНаСервере(ИдентификаторСтроки,Результат);
		///Модифицированность = Истина;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Функция ПолучитьПараметрыСтроки()
	//
	//Если ГоризонтальнаяОриентацияЭкрана Тогда
	//	ТекущиеДанные = Элементы.ТоварыГоризонт.ТекущиеДанные;
	//Иначе
		ТекущиеДанные = Элементы.Документы.ТекущиеДанные;
	//КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбновитьДанные",Истина);
	СтруктураПараметров.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	СтруктураПараметров.Вставить("Контрагент",          ТекущиеДанные.Контрагент);
	СтруктураПараметров.Вставить("КонтрагентUUID",      ТекущиеДанные.КонтрагентUUID);
	СтруктураПараметров.Вставить("НомерСтроки",         ТекущиеДанные.НомерСтроки);
	СтруктураПараметров.Вставить("ДокументUUID",        ТекущиеДанные.ДокументUUID);
	СтруктураПараметров.Вставить("СкладUUID",           ТекущиеДанные.СкладUUID);
	СтруктураПараметров.Вставить("НаименованиеДокумента",       "Номер "+ТекущиеДанные.НомерДокумента +" від "+ ТекущиеДанные.Дата+" ");

	
	СтруктураПараметров.Вставить("ВидДокумента",        ТекущиеДанные.ТипДокумента);
	Если ТекущиеДанные.ТипДокумента = "ZAK" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "PRIX" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",     ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу"));
		СтруктураПараметров.Вставить("НомерДокумента",  ТекущиеДанные.НомерДокумента);
	ИначеЕсли ТекущиеДанные.ТипДокумента = "Инвентаризация" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "Заказ" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "Поступление" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "RECLAM" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.Рекламация"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "Задание" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "ЗаданиеИН" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "Переоценка" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.Переоценки"));

		нМассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("НомерСтрокиДокумента",ТекущиеДанные.ИД));
		МассивСтрок = Новый Массив;
		стрСтруктура = "Артикул,НаименованиеТовара,КодХарактеристики,Характеристика,Продажи";
		
		для Каждого нСтрока Из нМассивСтрок Цикл 
			структураСтроки = Новый Структура(стрСтруктура);
			ЗаполнитьЗначенияСвойств(структураСтроки,нСтрока,стрСтруктура);
			МассивСтрок.Добавить(структураСтроки);
			
		КонецЦикла;
		СтруктураПараметров.Вставить("ТоварыПереоценки",МассивСтрок);
		СтруктураПараметров.Вставить("ИД_Переоценки",ТекущиеДанные.НомерДокумента);
	ИначеЕсли ТекущиеДанные.ТипДокумента = "ЗаданиеВФ" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ"));
		СтруктураПараметров.Вставить("ОписаниеЗадания", ТекущиеДанные.ДокументыЗаписьПоСтроке);
	ИначеЕсли ТекущиеДанные.ТипДокумента = "ЗаданиеТБД" Тогда	
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД"));
	ИначеЕсли ТекущиеДанные.ТипДокумента = "ЗаданиеТНП" Тогда	
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП")); 
	ИначеЕсли ТекущиеДанные.ТипДокумента = "ПроверкаСтандартов" Тогда	
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ПроверкаСтандартов"));
	ИначеЕсли  ТекущиеДанные.ТипДокумента = "zadel" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ФотоСчетчика"));
	ИначеЕсли  ТекущиеДанные.ТипДокумента = "zadyv" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.Уведомление"));
		СтруктураПараметров.Вставить("Инфо",ТекущиеДанные.Инфо);   
	ИначеЕсли  ТекущиеДанные.ТипДокумента = "zadvds" Тогда
		СтруктураПараметров.Вставить("ТипДокумента",    ПредопределенноеЗначение("Справочник.ТипыДокументов.ВыдачаДС"));
		СтруктураПараметров.Вставить("Инфо",ТекущиеДанные.Инфо);
	
	КонецЕсли;
	

	
	Возврат СтруктураПараметров;
КонецФункции


&НаСервере
Процедура НастроитьФормуПоТипуДокумента()
	 	
	ОчиститьДок = Истина;
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Заполнить", "Заголовок","Заповнити");

	ЦветоваяИндикация = Ложь;
	Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.ПриемПозаказу") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы,ПериодДокументов,ГруппаПечатьДокументов,ГруппаПодвал,ГруппаПечать", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		Элементы.СтрокаПоиска.Заголовок = "Ш\К, Артикул товара / Номер заказа";
		
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Инвентаризация") ИЛИ ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.СписокПриходов") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы,ПериодДокументов,ГруппаПодвал", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска,ГруппаПечать", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.ЗакладкиСверху);
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Перемещение") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы,ГруппаПечать,ГруппаПечатьДокументов,ПериодДокументов,ГруппаПодвал", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		Элементы.СтрокаПоиска.Заголовок = "ID перемещения";
		ЦветоваяИндикация = Истина;
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Переоценка") Тогда
	 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы,ПериодДокументов,ГруппаПодвал", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска,ГруппаПечать,ГруппаПечатьДокументов", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.ЗакладкиСверху);
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Печать") Тогда
	 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечать,ГруппаПечатьДокументов,СтраницаДокументы,ПериодДокументов", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.ЗакладкиСверху);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска", "Видимость", Ложь);
		КнопкаПечатьАкта = Ложь;
		Если ПечатьДокументаТип = 0 И ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
			КнопкаПечатьАкта = Истина;
		КонецЕсли;
		
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДокументыПечатьАкта", "Видимость", КнопкаПечатьАкта);
		
		
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.ПриемТоваров") Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы,ПериодДокументов,ГруппаПечатьДокументов,ГруппаПодвал,ГруппаПечать", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		Элементы.СтрокаПоиска.Заголовок = "Ш\К товара";
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Задание") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаОтбор,ГруппаПечатьДокументов", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		ОчиститьДок = Ложь;
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Zak") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечатьДокументов,ГруппаПечать,СтрокаПоиска", "Видимость", Ложь);
	ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Заявка") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПериодДокументов,ОтборКонтрагент,ГруппаПечать,СтрокаПоиска,СтраницаДокументы", "Видимость", Ложь);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
       	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Заполнить", "Заголовок","Створити заявку");
    ИначеЕсли ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Рекламация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПериодДокументов,ГруппаПечатьДокументов,ОтборКонтрагент,ГруппаПечать,СтрокаПоиска,СтраницаДокументы", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска", "Видимость", Ложь);
	КонецЕсли;
	
	ИспользоватьОформление = Ложь;
	//Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.СписокПриходов") Тогда
	//	ИспользоватьОформление = Истина;
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПанель", "Видимость", Истина);
	////ИначеЕсли 	 ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Печать")  Тогда
	////	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаДокументы", "Видимость", Истина);

	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПанель", "Видимость", Ложь);
	//КонецЕсли;
	
	Если ОчиститьДок Тогда
		Объект.Документы.Очистить();
	КонецЕсли;
	
	
	УстановитьУО(ИспользоватьОформление);

КонецПроцедуры




&НаКлиенте
Процедура ТипыДокументовПриИзменении(Элемент)
	НастроитьФормуПоТипуДокумента();

КонецПроцедуры

&НаСервере
Процедура УстановитьУО(ИспользоватьОформление) 
	ЭтаФорма.УсловноеОформление.Элементы.Получить(0).Использование = ИспользоватьОформление;
	ЭтаФорма.УсловноеОформление.Элементы.Получить(1).Использование = ИспользоватьОформление;
	Если ТипыДокументов = ПредопределенноеЗначение("Перечисление.ТипыДокументов.Переоценка") Тогда
		ЭтаФорма.УсловноеОформление.Элементы.Получить(2).Использование = Истина;
		ЭтаФорма.УсловноеОформление.Элементы.Получить(3).Использование = Истина;
		ЭтаФорма.УсловноеОформление.Элементы.Получить(4).Использование = Истина;

	Иначе
		ЭтаФорма.УсловноеОформление.Элементы.Получить(2).Использование = Ложь;
		ЭтаФорма.УсловноеОформление.Элементы.Получить(3).Использование = Ложь;
		ЭтаФорма.УсловноеОформление.Элементы.Получить(4).Использование = Ложь;

	КонецЕсли;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОчиститьРеквизиты(ТипДокумента)
	Если ТипДокумента = "Контрагент" Тогда
		КонтрагентОтбор = "";
		КонтрагентОтборUUID = "";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьРеквизиты(СтруктураОтвета,ТипРеквизита)
	Если ТипРеквизита = "Контрагент"	Тогда
		КонтрагентОтбор = СтруктураОтвета.Name;
		КонтрагентОтборUUID = СтруктураОтвета.UUID;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОтборОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьРеквизиты("Контрагент");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКонтрагента(Команда)
	
	Если Не Инициализирован Тогда
		Сообщить("Устройство не инициализировано");
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(КонтрагентОтбор) Тогда
	    	ОчиститьРеквизиты( "Контрагент");
		Иначе
			СтуктураОтвет =  ИнтеграцияТК_Клиент.ПолучитьКонтрагентаПоЕДРПО(КонтрагентОтбор);
		Если СтуктураОтвет.Результат Тогда
			ЗаполнитьРеквизиты(СтуктураОтвет.Ответ,"Контрагент");
		Иначе
			 ОчиститьРеквизиты("Контрагент");
		 КонецЕсли;
	 КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ОбработатьПолученныйШтрихкод(СтрокаПоиска, ДополнительныеПараметры);
	СтрокаПоиска = "";      
КонецПроцедуры



&НаКлиенте
Процедура ПечатьРеестра(Команда)

	Если Объект.Документы.Количество() = 0 Тогда
		Сообщить("Нет документов для печати!");
		Возврат;
	КонецЕсли;
	
	Если ПечатьДокументаТип = 0 Тогда
		ТипДок = "ПоступлениеТоваров";
	ИначеЕсли ПечатьДокументаТип = 1 Тогда
		ТипДок = "Перемещение";
	ИначеЕсли ПечатьДокументаТип = 2 Тогда
		ТипДок = "Списание";
	ИначеЕсли ПечатьДокументаТип = 3 Тогда
		ТипДок = "Инвентаризация"; 
	ИначеЕсли ПечатьДокументаТип = 5 Тогда
		ТипДок = "ВозвратПоставщику";
	ИначеЕсли ПечатьДокументаТип = 6 Тогда
		ТипДок = "ИнвентаризацияРеестр";
   	ИначеЕсли ПечатьДокументаТип = 7 Тогда
		ТипДок = "Реестр";

	Иначе
		ТипДок = "ПоступлениеТоваров";

	КонецЕсли;
	
	
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
		
		ТабДок = ПечатнаяФормаРеестра(ТипДок);  
		ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(ТабДок);
	Иначе
		
		ДанныеДляПечати  = СформироватьТабдокРеестра(ТипДок);
		
		
		Если Не ДанныеДляПечати.Результат Тогда
			Если НЕ ПустаяСтрока(ДанныеДляПечати.ОписаниеОшибки) Тогда
				Сообщить(ДанныеДляПечати.ОписаниеОшибки);
			КонецЕсли;
		Иначе	
			Сообщить("Реестр отправлен на печать");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатнаяФормаРеестра(ТипДок) 
	Если ТипДок = "Реестр" Тогда  
		ТабДок = Обработки.ПанельМеню.ПечатьРеестрОбщий(Объект.Документы);
	Иначе
		ТабДок = Обработки.ПанельМеню.ПечатьРеестра(Объект.Документы,ТипДок);
	КонецЕсли;
	Возврат  ТабДок
КонецФункции

&НаСервере
Функция СформироватьТабдокРеестра(ТипДок)
	ТабДок = ПечатнаяФормаРеестра(ТипДок);
	
	Рез = ИнтеграцияТК_ВызовСервера.ПоставитьВочередьНаПечать(ТабДок,"РеестрПриходов");	
	
	Возврат Рез ;
	
КонецФункции


&НаКлиенте
Процедура Фото(Команда)
	#Если МобильноеПриложениеКлиент Тогда 
		
		ФайлКартинки = ПолучитьИмяВременногоФайла("jpg");
		Запуск = Новый ЗапускПриложенияМобильногоУстройства("android.media.action.IMAGE_CAPTURE");
		
		Запуск.ДополнительныеДанные.Добавить("output", "file://" + ФайлКартинки, "Uri");
		
		Рез = Запуск.Запустить(Истина);
	#КонецЕсли

КонецПроцедуры


&НаКлиенте
Процедура ПечатьАкта(Команда)
	
	
	ПараметрыСтроки = ПолучитьПараметрыСтроки();
	
	Если ПараметрыСтроки = Неопределено Тогда
		Сообщить("Нет документа для печати");
		Возврат;
	Иначе	
		СтруктураДокумента = Новый Структура("ДокументUUID,ДоументСервер",ПараметрыСтроки.ДокументUUID,Истина);
		
		Если ПечатьДокументаТип = 0 Тогда
			ТекВидДок ="PrintPTA";
			
		Иначе
			Сообщить("Не известный тип документа");
			Возврат;
		КонецЕсли;
		
		Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
			
			СтруктураДокумента.Вставить("ТипДокумента",ТекВидДок);
			Рез =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(СтруктураДокумента);
			
			Если Рез.Результат Тогда
				ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(Рез.Ответ);
			Иначе
				Сообщить(Рез.ОписаниеОшибки);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ВернутьТипПечати(ТекДок)
    ПарамПечатнаяФорма = "PrintPT";
	Если ТекДок = "РеестрПриходов" Тогда 
		ПарамПечатнаяФорма = "PrintPT";
	ИначеЕсли ТекДок = "PrintPR" ИЛИ ТекДок = "PrintPRP" Тогда   
		ПарамПечатнаяФорма = "PrintPR";
	Иначе   
		ПарамПечатнаяФорма = ТекДок;
	КонецЕсли;
	
	Возврат ПарамПечатнаяФорма;
	
КонецФункции


&НаКлиенте
Процедура Печать(Команда)
	ПараметрыСтроки = ПолучитьПараметрыСтроки();
	
	Если ПараметрыСтроки = Неопределено Тогда
		Сообщить("Нет документа для печати");
		Возврат;
	Иначе	
		СтруктураДокумента = Новый Структура("ДокументUUID,ДоументСервер",ПараметрыСтроки.ДокументUUID,Истина);
		ПарамТекВидДок = ВернутьТипПечати(ПараметрыСтроки.ВидДокумента);
	КонецЕсли;
	
	Если ПарамТекВидДок = "PrintPT" Тогда
		//ВыбратьФормуПечати(СтруктураДокумента);
		ПечататьДокумент(СтруктураДокумента, "PrintPTA");
	Иначе
		ПечататьДокумент(СтруктураДокумента, ПарамТекВидДок);
	КонецЕсли;
	

КонецПроцедуры  


&НаКлиенте
 Асинх Процедура ВыбратьФормуПечати(СтруктураДокумента) 
	 
	 СписокВыбора = Новый СписокЗначений;
	 СписокВыбора.Добавить("PrintPTA","АКТ");
	 СписокВыбора.Добавить("PrintPT","Накладна");  
	
	 Ответ = Ждать ВыбратьИзМенюАсинх(СписокВыбора);   
	 Если Не Ответ = Неопределено Тогда
		 ЗначениеВыбора = Ответ.Значение; 
		 ПечататьДокумент(СтруктураДокумента,ЗначениеВыбора) 
	 КонецЕсли;
	 
	  
 КонецПроцедуры


&НаКлиенте
Процедура ПечататьДокумент(СтруктураДокумента,ТекВидДок)  
		
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
		
		СтруктураДокумента.Вставить("ТипДокумента",ТекВидДок);
		Рез =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(СтруктураДокумента);
		
		Если Рез.Результат Тогда
			ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(Рез.Ответ);
		Иначе
			Сообщить(Рез.ОписаниеОшибки);
		КонецЕсли;
		
	Иначе
		
		Рез = ИнтеграцияТК_ВызовСервера.ИнициализироватьДанныеДляПечати(СтруктураДокумента,ТекВидДок);
		
		Если Рез.Результат Тогда
			Сообщить("Документ отправлен на печать!");
			
		Иначе
			Сообщить(Рез.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПечатьДокументаТипПриИзменении(Элемент)
	Объект.Документы.Очистить();
	//КнопкаПечатьАкта = Ложь;
	//Если ПечатьДокументаТип = 0 И ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
	//	КнопкаПечатьАкта = Истина;
	//КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПериодДокументов", "Видимость", ПечатьДокументаТип <> 8);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДокументыПечатьАкта", "Видимость", КнопкаПечатьАкта);

	
КонецПроцедуры

&НаКлиенте
Процедура ТипыДокументовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника()
КонецПроцедуры
